app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT * FROM "tasks"

   def add
      @task = Task.new(params[:task])
      respond_to do |format|
        if @task.save
---
INSERT INTO "tasks" ("name", "created_at", "updated_at", "deleted", "description") VALUES(NULL, '2010-03-11 07:23:47', '2010-03-11 07:23:47', NULL, NULL)